giesekusModelStudies/alpha_100e-2/20030b_GiesekusSteadyUniaxElongation/constant/constitutiveProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  7.0                                   |
|   \\  /    A nd           | Website:  https://openfoam.org                  |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      constitutiveProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

parameters
{ 

                type             Giesekus;

                etaS             etaS [1 -1 -1 0 0 0 0] 0;
		etaP             etaP [1 -1 -1 0 0 0 0] 333;                               
                lambda           lambda [0 0 1 0 0 0 0] 1;
                alpha		 alpha  [0 0 0 0 0 0 0] 1.0;             
                stabilization    none;
                rho              rho [1 -3 0 0 0 0 0] 800; 
          
}

rheoTestFoamParameters
{
              // Ramp mode (true) or transient mode (false)
                ramp 		 true;

              // This tensor multiplied by gammaEpsilonDot gives nabla(U)
                gradU            ( 1.    0.    0.
                                   0.   -0.5   0.
                                   0.    0.   -0.5); 

              // Either strain rate or extensional rate (1/s) list (if ramp=false, only the first value in the list is read) 
                gammaEpsilonDotL 
                  (     
                        //1e-6
			//1e-5
			1e-4
			1e-3
			1e-2
			1e-1
			1e0
			1e1
			1e2
			1e3
			1e4
			1e5
			1e6 
                 );
}
// ************************************************************************* //

